Revit 2026 API

# TopographySurfaceIsValidFaceSet Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidFaceSet(
	IList<PolymeshFacet> facets,
	IList<XYZ> points
)
```
```vb
Public Shared Function IsValidFaceSet (
	facets As IList(Of PolymeshFacet),
	points As IList(Of XYZ)
) As Boolean
```
```cpp
public:
static bool IsValidFaceSet(
	IList<PolymeshFacet^>^ facets,
	IList<XYZ^>^ points
)
```
```fsharp
static member IsValidFaceSet :
        facets : IList<PolymeshFacet> *
        points : IList<XYZ> -> bool
```

#### Parameters

facets IListPolymeshFacet

points IListXYZ

#### Return Value

Boolean

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace